[
    "Invite a stranger to take a selfie with you and then upload it to your Snapgram",
    "Randomly pick some numbers from your contacts and send them an SMS saying 'I'm pregnant.'",
    "Take any drink near you, mix it with chili, and drink it!",
    "Randomly pick a number from your contacts, call them, and say 'I love you.'",
    "Buy the cheapest food in the canteen (or buy a bottle of water) and say tearfully to your classmates, 'This... is the most expensive food I've ever bought... sob.'",
    "Buy a bottle of Coca-Cola and pour it on flowers in front of many people.",
    "Stand near the fridge, close your eyes, randomly pick food inside, and keep your eyes closed while eating.",
    "Stand in the middle of the basketball court and shout, 'I LOVE YOU MY PRINCE/PRINCESS!'",
    "Salute someone in the class, then say, 'I am ready to serve you, Your Majesty.'",
    "Walk while clapping and singing 'Happy Birthday' from the classroom to the corridor.",
    "Kneel on one knee and say 'Marry me?' to the first person who enters the room.",
    "Make a ridiculous head decoration from tissue, whatever it is, then pose in front of the camera and upload it.",
    "Say 'YOU ARE REALLY BEAUTIFUL, NO JOKE' to the girl you think is the prettiest in this class.",
    "Tell a teacher, 'Ma'am/Sir, my clothes feel tight' with a pleading expression.",
    "Tell someone in the class, 'I was just told I am your twin, we were separated, then I had plastic surgery. And this is the most serious thing I've ever said.'",
    "Throw someone's notebook into the trash in front of them while saying, 'No one can understand what's in this book.'",
    "Pluck your own leg hair three times.",
    "Chat your parents saying you miss them, complete with sad emoticons.",
    "Try searching Google about scary or funny things like trypophobia, etc.",
    "Sit relaxed in the middle of the basketball court pretending it's a beach to sunbathe.",
    "Fill your mouth with water and hold it for two rounds. If you laugh and spill or swallow, you must refill and add one more round.",
    "Shake hands with the first person who enters this room and say, 'Welcome to Who Wants To Be a Millionaire!'",
    "Send an SMS to your parents saying, 'Hi, bro! I just bought the latest Playboy magazine!'",
    "Send an SMS to your parents, 'Mom, Dad, I already know that I am an adopted child from an orphanage. Please don't hide this anymore.'",
    "Send an SMS to three random numbers in your contacts saying, 'I just became a Playboy magazine model.'",
    "Eat one tablespoon of sweet soy sauce and salty soy sauce!",
    "Eat something without using your hands.",
    "Get angry at your friend who didn't come even though you planned to play 'truth or dare' together.",
    "Crack an egg using your head.",
    "Eat food that has been mixed together and tastes weird, but make sure it is not harmful to your health in the short or long term.",
    "Dance like Girls' Generation if you are a boy in front of the class, or dance like Super Junior if you are a girl.",
    "Raise the flagpole without a flag.",
    "Flirt with your crush, closest friend, a stranger of the opposite gender, and so on.",
    "Copy all your friends' hairstyles.",
    "Sing the song HAI TAYO in front of many people while dancing.",
    "Sing the song Iwak Peyek loudly in the classroom.",
    "Borrow something from a neighbor.",
    "Ask for an autograph from the teacher you hate the most while saying, 'You are truly the person I admire most in the world.'",
    "Ask a random person on the street for money while saying, 'I don't have money to take the bus.'",
    "Drink something that has been made/agreed upon, but make sure it is not dangerous, like syrup mixed with salt and soy sauce.",
    "Drink three sips of tea or coke (Coca-Cola or Sprite) mixed with chili sauce.",
    "Send a scared emoticon to your crush, chat about anything, via any platform.",
    "Sing your favorite Disney songs outside loudly while shouting.",
    "Say 'one blue' to 'ten blue' quickly without making mistakes. If you make a mistake, start over.",
    "Wear a paper crown and say to everyone in the room, 'PAY RESPECT TO HIS MAJESTY THE KING' while pointing at each person with a ruler.",
    "Wear your pants inside out until the next morning.",
    "Hold a basketball, stand in front of the class, and shout, 'WHO KNOWS WHY THIS GOLF BALL IS SO BIG? DID THE FACTORY MESS UP?'",
    "Hug someone you DON'T like in class and say, 'Thank you so much for being the kindest person to me.'",
    "Go to a wide field, then run as fast as you can while saying 'I'm crazy, I'm crazy.'",
    "Pick a flower and stick it to a stranger (must be opposite gender).",
    "Randomly pick someone on the street and say, 'You don't know you're beautiful' (like One Direction).",
    "Pretend to be possessed, e.g., possessed by a tiger, etc.",
    "Make someone whistle while their mouth is full of food.",
    "Make someone be a waiter to serve you and your friends lunch.",
    "Make someone wear socks as gloves.",
    "Make someone wear the weirdest hat/most absurd helmet for the next 3 rounds.",
    "Call your mom and say, 'Mom, I want to get married as soon as possible.'",
    "Call your ex and say, 'I miss you.'",
    "Shout 'HEY I'M JACK, LISTEN TO MY ROAR, ROAAAAR!' in a crowded place.",
    "Swap clothes with your closest friend until the next round.",
    "Update your status on BBM, Line, WA, or whatever with words all starting with 'T'.",
    "Upload a video of yourself singing popular songs to YouTube.",
    "Paint your fingernails and toenails different colors for a week."
]
