[
    "What is the most disgusting TV show? Give your reasons!",
    "What is the ugliest outfit (in your opinion) that you have ever worn, and when did you wear it?",
    "What Patronus animal suits you?",
    "What is the worst thing you have ever said about your friend?",
    "What is the most embarrassing thing about yourself?",
    "What is the most embarrassing thing about your friend?",
    "What is the first thing you notice when you see someone of the opposite gender?",
    "What is the first thing that comes to your mind when you look in the mirror?",
    "What is the dumbest thing you have ever done?",
    "What is the dumbest thing you have ever done?",
    "What is your biggest fear?",
    "What is your worst nightmare?",
    "What is the silliest dream you can remember?",
    "What is the most ridiculous job you have imagined yourself doing?",
    "What do you think is your worst trait?",
    "What trait do you want to change about yourself?",
    "What trait do you want to change about your friend?",
    "What would you do if your partner said your nose or finger is ugly?",
    "What do you think about before you sleep? e.g., daydreaming about a soulmate, etc.",
    "What do you think is the most outstanding thing about yourself?",
    "Which part of your friend's body do you like the most and wish you had?",
    "Which part of your body do you hate the most?",
    "Among all the classes at school, which class do you most want to join and which class do you most want to avoid?",
    "Describe your closest friend!",
    "Describe yourself in one word!",
    "What movie and song have ever made you cry?",
    "What is something you have kept secret until now and no one knows?",
    "What is the most romantic thing someone (of the opposite gender) has ever done or given to you?",
    "What disgusting things have you ever experienced?",
    "If you were reborn and had to be one of your friends, who would you choose to be?",
    "If you had superpowers, what would you want to do?",
    "If the apocalypse was coming soon, what would you do?",
    "If you had to do plastic surgery to look like a classmate, whose face would you copy?",
    "Have you ever stolen something?",
    "Are you afraid of dying? Why?",
    "When was the last time you cried and why?",
    "What is your special ability?",
    "How did you end up liking the person you like?",
    "In your opinion, what is a good trait of your closest friend that they don't realize?",
    "What kind of person do you want to marry someday?",
    "What is the most pathetic job you think suits the friend to your right?",
    "Who do you want to swap lives with for a day? (closest friend you both know) and why?",
    "Have you ever secretly hoped someone's relationship with their partner would end? Who?",
    "Choose PARTNER or FRIEND? Give your reasons!",
    "What is the quote you remember and like the most?",
    "What secret have you never told your friend until now?",
    "Who is your role model?",
    "Who among your friends do you think is materialistic?",
    "Who among your friends do you think has the worst haircut?",
    "Who among your friends is the least photogenic and looks like a horse when laughing in photos?",
    "Who is your most beautiful ex? And why did you break up?",
    "Which celebrity's photo have you secretly kissed?",
    "Which male teacher did you like in the past?",
    "Which ex of your friend did you secretly like?",
    "Who is the person (of the opposite gender) you think would be fun to have as a partner?",
    "Who is the person you hate but think they like you (not necessarily opposite gender)?",
    "Who is the person you have secretly followed?",
    "Who of the opposite gender comes to your mind most often?",
    "Who is the most annoying person among your friends? Give reasons!",
    "Who among your friends do you think really needs a makeover?",
    "Who here comes closest to your ideal partner type?"
]
